app/controllers/categories_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`category_id` = 1 ORDER BY `products`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def show
    @products = @category.products.paginate(page: params[:page], per_page: 10).order(updated_at: :desc)

SELECT `categories`.* FROM `categories` WHERE (id in (SELECT categories_cities.category_id from categories_cities
SELECT COUNT(*) FROM `categories` WHERE (id in (SELECT categories_cities.category_id from categories_cities
---
  def getByCity
    @category = Category.where(["id in (SELECT categories_cities.category_id from categories_cities
WHERE categories_cities.city_id = ?)", params[:cityId]])
    respond_to do |format|
      if @category.empty?