app/controllers/products_controller.rb

  def getByCategory
    @product = Product.where(["category_id = ?", params[:category_id]])
    respond_to do |format|
      if @product.empty?
---
SELECT `products`.* FROM `products` WHERE (category_id = '1')
SELECT COUNT(*) FROM `products` WHERE (category_id = '1')

  def getByCityAndCategory
    @products = Product.select("products.id, products.name, products.logo, products.is_del, products.category_id,
prices.price1, prices.price2, prices.price3, prices.price4, prices.price5, prices.price6").joins("left join prices on
 prices.product_id = products.id").where(["category_id =?", params[:categoryId]])
       respond_to do |format|
      if @products.empty?
---
SELECT `products`.* FROM `products` WHERE (category_id = NULL)

    def set_category
      @category = Category.find(params[:category_id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1