app/controllers/users_controller.rb

INSERT INTO `users` (`mobile`, `email`, `encrypted_password`, `name`, `created_at`, `updated_at`) VALUES ('007', '123@qq.com', '1111111', 'user3', '2017-04-09 14:21:23', '2017-04-09 14:21:23')
---
  def create
    @user = User.new(create_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `mobile` = '127890', `encrypted_password` = '123456', `updated_at` = '2017-04-13 16:00:01' WHERE `users`.`id` = 12
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT `users`.* FROM `users` WHERE (mobile = '16126218@bjtu.edu.cn' and reset_password_token = '461031' and reset_password_sent_at >= '2017-04-14 15:17:57.907522')
SELECT COUNT(*) FROM `users` WHERE (mobile = '16126218@bjtu.edu.cn' and reset_password_token = '461031' and reset_password_sent_at >= '2017-04-14 15:17:57.907522')
---
  def setPassword
    @user = User.where(["mobile = ? and reset_password_token = ? and reset_password_sent_at >= ?", params[:mobile],
                        params[:password_token], Time.new-1800])
    respond_to do |format|
      if @user.empty?

SELECT `users`.* FROM `users` WHERE (mobile = '186' and encrypted_password = '111111')
SELECT COUNT(*) FROM `users` WHERE (mobile = '186111123' and encrypted_password = '1111111')
---
  def login
    @user = User.where(["mobile = ? and encrypted_password = ?", params[:mobile], params[:encrypted_password]])

    respond_to do |format|
      if @user.empty?

SELECT `users`.* FROM `users` WHERE (mobile = '186' and encrypted_password = '111111')
SELECT COUNT(*) FROM `users` WHERE (mobile = '186' and encrypted_password = '111111')
UPDATE `users` SET `encrypted_password` = '123456', `updated_at` = '2017-04-13 17:21:31' WHERE `users`.`id` = 3
---
  def reset
    mobile = session['mobile']
    @user = User.where(["mobile = ? and encrypted_password = ?", mobile, params[:old_encrypted_password]])
    respond_to do |format|
      if @user.empty?
        format.json { render :json => {:data => "Reset failed"}.to_json }
      else
        first = @user[0]
        first.update_attributes(:encrypted_password => params[:new_encrypted_password])

INSERT INTO `users` (`mobile`, `reset_password_token`, `reset_password_sent_at`, `created_at`, `updated_at`) VALUES ('16126218@bjtu.edu.cn', '626408', '2017-04-14 15:55:06', '2017-04-14 15:55:06', '2017-04-14 15:55:06')
---
  def registerEmail
    recipient = params[:mobile]
    subject = "验证码"
    message = rand(999999).to_s
    Emailer.contact(recipient, subject, message).deliver_now!

    @user = User.new(:mobile => recipient)
    @user.reset_password_token = message
    @user.reset_password_sent_at = Time.new

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE (mobile = '16126218@bjtu.edu.cn')
SELECT COUNT(*) FROM `users` WHERE (mobile = '16126218@bjtu.edu.cn')
UPDATE `users` SET `reset_password_token` = '461031', `updated_at` = '2017-04-14 15:10:46' WHERE `users`.`id` = 16
---
  def resetEmail
    recipient = params[:mobile]
    subject = "验证码"
    message = rand(999999).to_s
    Emailer.contact(recipient, subject, message).deliver_now!

    @user = User.where(["mobile = ?",recipient])

    respond_to do |format|
      if @user.empty?
        format.json { render :json => {:data => "Send failed"}.to_json }
      else
        first = @user[0]
        first.update_attributes(:reset_password_token => message)

SELECT `users`.* FROM `users` WHERE (mobile = '16126218@bjtu.edu.cn' and reset_password_token = '461031' and reset_password_sent_at >= '2017-04-14 15:10:00.439610')
---
  def set_user
    @user = User.find(params[:id])